#+PROPERTY: noweb yes

* Set up global grid

This is a global $5'$ that runs from 67N to 60S.  Write a CDO grid
description file.  


** $5'$ global grid

#+BEGIN_SRC sh :results output verbatim
  cat <<EOF > global_5min.grid
  gridtype = lonlat 
  xsize    = 4320
  ysize    = 1524
  xfirst   = -179.95833333
  xinc     =    0.08333333 
  yfirst   =  -59.95833 
  yinc     =    0.08333333
  EOF
  cat global_5min.grid
#+END_SRC

#+RESULTS:
: gridtype = lonlat 
: xsize    = 4320
: ysize    = 1524
: xfirst   = -179.95833333
: xinc     =    0.08333333 
: yfirst   =  -59.95833 
: yinc     =    0.08333333

** $30'$ global grid

#+BEGIN_SRC sh :results output verbatim
  cat <<EOF > global_30min.grid
  gridtype = lonlat 
  xsize    =  720
  ysize    =  254
  xfirst   = -179.75
  xinc     =    0.5
  yfirst   =  -59.75
  yinc     =    0.5
  EOF
  cat global_30min.grid
#+END_SRC

#+RESULTS:
: gridtype = lonlat 
: xsize    =  720
: ysize    =  254
: xfirst   = -179.75
: xinc     =    0.5
: yfirst   =  -59.75
: yinc     =    0.5

This will be used to resample the input data.


* Compose and execute CDO commands
  :PROPERTIES:
  :session:  *R*
  :tangle:   tangle/cdo.R
  :results:  silent
  :END:

#+NAME:watchVars
#+BEGIN_SRC R :eval no
  watchVars <- c(
    precip= "pr_gpcc",
    solar=  "rsds",
    tmax=   "tasmax",
    tmin=   "tasmin")
#+END_SRC

#+BEGIN_SRC R
  library( stringr)
  library( doMC)
  registerDoMC( 4)
  
  <<watchVars>>
  
  watchInput <-
    list.files(
      path= "data/input",
      pattern= sprintf(
        "^(%s)",
        paste( watchVars, collapse= "|")),
      full.names= TRUE)
  
  cdoCommands <-
    sprintf(
      paste(
        "cdo -O -f nc4 -z zip splityear %s",
        "data/output/%s_watch_",
        "2>&1"),
      watchInput,
      str_match( watchInput, "data/input/([a-z]+_?[a-z]*)_watch")[,2])
  
  annualFiles <-
    list.files(
      path= "data/output",
      pattern= "^.+_watch_[0-9]{4}.nc4$",
      full.names= TRUE)
  
  annualFiles30min <-
    str_replace( annualFiles, "\\.nc4$", "_30min.nc4")
  
  cdoRemapCommands <-
    paste(
      "cdo -O -f nc4 -z zip remapnn,global_30min.grid",
      annualFiles,
      annualFiles30min,
      "2>&1")
  
  ## watchVars)
  ## names( cdoCommands) <- watchVars
#+END_SRC

#+BEGIN_SRC R :results value replace
  head( cdoCommands)
#+END_SRC

#+RESULTS:
| cdo -O -f nc4 -z zip splityear data/input/pr_gpcc_watch_1958-1959.nc4 data/output/pr_gpcc_watch_ 2>&1 |
| cdo -O -f nc4 -z zip splityear data/input/pr_gpcc_watch_1960-1969.nc4 data/output/pr_gpcc_watch_ 2>&1 |
| cdo -O -f nc4 -z zip splityear data/input/pr_gpcc_watch_1970-1979.nc4 data/output/pr_gpcc_watch_ 2>&1 |
| cdo -O -f nc4 -z zip splityear data/input/pr_gpcc_watch_1980-1989.nc4 data/output/pr_gpcc_watch_ 2>&1 |
| cdo -O -f nc4 -z zip splityear data/input/pr_gpcc_watch_1990-1999.nc4 data/output/pr_gpcc_watch_ 2>&1 |
| cdo -O -f nc4 -z zip splityear data/input/pr_gpcc_watch_2000-2001.nc4 data/output/pr_gpcc_watch_ 2>&1 |

#+BEGIN_SRC R :results value replace
  head( cdoRemapCommands)
#+END_SRC

#+RESULTS:
| cdo -O -f nc4 -z zip remapnn,global_30min.grid data/output/pr_gpcc_watch_1958.nc4 data/output/pr_gpcc_watch_1958_30min.nc4 2>&1 |
| cdo -O -f nc4 -z zip remapnn,global_30min.grid data/output/pr_gpcc_watch_1959.nc4 data/output/pr_gpcc_watch_1959_30min.nc4 2>&1 |
| cdo -O -f nc4 -z zip remapnn,global_30min.grid data/output/pr_gpcc_watch_1960.nc4 data/output/pr_gpcc_watch_1960_30min.nc4 2>&1 |
| cdo -O -f nc4 -z zip remapnn,global_30min.grid data/output/pr_gpcc_watch_1961.nc4 data/output/pr_gpcc_watch_1961_30min.nc4 2>&1 |
| cdo -O -f nc4 -z zip remapnn,global_30min.grid data/output/pr_gpcc_watch_1962.nc4 data/output/pr_gpcc_watch_1962_30min.nc4 2>&1 |
| cdo -O -f nc4 -z zip remapnn,global_30min.grid data/output/pr_gpcc_watch_1963.nc4 data/output/pr_gpcc_watch_1963_30min.nc4 2>&1 |

#+BEGIN_SRC R :results silent
  cdoOutput <- 
    foreach( cdo= cdoCommands) %dopar% {
      system( cdo, intern= TRUE)
    }
#+END_SRC

#+BEGIN_SRC R :results silent
  cdoOutput <- 
    foreach( cdo= cdoRemapCommands) %dopar% {
      system( cdo, intern= TRUE)
    }
#+END_SRC

#+BEGIN_SRC R :results value replace
  cdoOutput
#+END_SRC

#+RESULTS:
| cdo remapnn: Processed 4165603200 values from 1 variable over 16071 timesteps ( 11192.19s ) | cdo remapnn: Processed 4165603200 values from 1 variable over 16071 timesteps ( 11306.74s ) | cdo remapnn: Processed 4165603200 values from 1 variable over 16071 timesteps ( 11287.92s ) | cdo remapnn: Processed 4165603200 values from 1 variable over 16071 timesteps ( 11399.20s ) |



* Create a mask from the first day's data
  :PROPERTIES:
  :session:  *R*
  :END:

#+BEGIN_SRC sh :session :results output
  gdal_translate -ot Byte -b 1 \
      -a_srs EPSG:4326 \
      -a_ullr -180 67 180 -60 \
      -a_nodata 255 \
      -scale 0 1 1 1 \
      data/output/pr_gpcc_watch_1958_30min.nc4 \
      data/output/watchMask30min.tif
#+END_SRC

#+RESULTS:
: Input file size is 720, 254
: 0...10...20...30...40...50...60...70...80...90...100 - done.

#+BEGIN_SRC sh :session :results output
  gdalinfo data/output/watchMask30min.tif
#+END_SRC

#+RESULTS:
#+begin_example
Driver: GTiff/GeoTIFF
Files: data/output/watchMask30min.tif
Size is 720, 254
Coordinate System is:
GEOGCS["WGS 84",
    DATUM["WGS_1984",
        SPHEROID["WGS 84",6378137,298.257223563,
            AUTHORITY["EPSG","7030"]],
        AUTHORITY["EPSG","6326"]],
    PRIMEM["Greenwich",0],
    UNIT["degree",0.0174532925199433],
    AUTHORITY["EPSG","4326"]]
Origin = (-180.000000000000000,67.000000000000000)
Pixel Size = (0.500000000000000,-0.500000000000000)
Metadata:
  AREA_OR_POINT=Area
  lat#axis=Y
  lat#long_name=latitude
  lat#standard_name=latitude
  lat#units=degrees_north
  lon#axis=X
  lon#long_name=longitude
  lon#standard_name=longitude
  lon#units=degrees_east
  NC_GLOBAL#CDI=Climate Data Interface version 1.5.9 (http://code.zmaw.de/projects/cdi)
  NC_GLOBAL#CDO=Climate Data Operators version 1.5.9rc1 (http://code.zmaw.de/projects/cdo)
  NC_GLOBAL#comment=WATCH Forcing Data converted for ISI-MIP use by M.Buechner (buechner@pik-potsdam.de)
  NC_GLOBAL#Conventions=CF-1.0
  NC_GLOBAL#history=Wed May 08 22:26:11 2013: cdo -O -f nc4 -z zip remapnn,global_30min.grid data/output/pr_gpcc_watch_1958.nc4 data/output/pr_gpcc_watch_1958_30min.nc4
Wed May 08 10:21:34 2013: cdo -O -f nc4 -z zip splityear data/input/pr_gpcc_watch_1958-1959.nc4 data/output/pr_gpcc_watch_
  pr#_FillValue=1e+20
  pr#code=1
  pr#long_name=precipitation flux
  pr#standard_name=precipitation_flux
  pr#units=kg m-2 s-1
  time#calendar=proleptic_gregorian
  time#standard_name=time
  time#units=days since 1860-01-01 00:00:00
Image Structure Metadata:
  INTERLEAVE=BAND
Corner Coordinates:
Upper Left  (-180.0000000,  67.0000000) (180d 0' 0.00"W, 67d 0' 0.00"N)
Lower Left  (-180.0000000, -60.0000000) (180d 0' 0.00"W, 60d 0' 0.00"S)
Upper Right ( 180.0000000,  67.0000000) (180d 0' 0.00"E, 67d 0' 0.00"N)
Lower Right ( 180.0000000, -60.0000000) (180d 0' 0.00"E, 60d 0' 0.00"S)
Center      (   0.0000000,   3.5000000) (  0d 0' 0.01"E,  3d30' 0.00"N)
Band 1 Block=720x11 Type=Byte, ColorInterp=Gray
  NoData Value=255
  Metadata:
    _FillValue=1e+20
    code=1
    long_name=precipitation flux
    NETCDF_DIMENSION_time=35794
    NETCDF_time_units=days since 1860-01-01 00:00:00
    NETCDF_VARNAME=pr
    standard_name=precipitation_flux
    units=kg m-2 s-1
#+end_example


#+NAME: watchMask
#+BEGIN_SRC R :results silent
  watchMask <- setMinMax(
    raster( "data/output/watchMask30min.tif"))
#+END_SRC

** write out CSV of WATCH mask

#+BEGIN_SRC R :tangle
  world30min <- raster()
  res( world30min) <- 30/60
  world30min[] <- 1:ncell( world30min)
  watchCells <- crop( world30min, watchMask)
  watchCells <- mask( watchCells, watchMask)
  
  rowColDf <-
    as.data.frame(
      rowColFromCell(
        world30min,
        watchCells[ !is.na( watchCells[])]))
  
  rowColDf$global30min <-
    with(
      rowColDf,
      cellFromRowCol( world30min, row, col))
    
  write.csv(
    rowColDf,
    file= "data/output/watchMask30min.csv",
    row.names= FALSE)
  
#+END_SRC

#+BEGIN_SRC sh :session :results verbatim
  head data/output/watchMask30min.csv
#+END_SRC

#+RESULTS:
#+begin_example
"row","col","global30min"
47,1,33121
47,2,33122
47,3,33123
47,4,33124
47,5,33125
47,6,33126
47,7,33127
47,8,33128
47,9,33129
#+end_example


* Use scheduler to write .psims.nc4 files
  :PROPERTIES:
  :session:  *R*
  :END:


** The little-r script that runs on the nodes
   :PROPERTIES:
   :tangle:   tangle/cellNc.r
   :END:

#+BEGIN_SRC R :results silent :shebang #!/home/nbest/local/bin/r 
  ## --interactive
  
  stripe <- as.integer( argv[ 1])
  years <- 1958:2001
  
  library( ncdf4)
  library( raster)
  library( abind)
  library( ascii)
  options( asciiType= "org")
  
  library( doMC)  
  registerDoMC( multicore:::detectCores())
  
  ## options( error= recover)
  
#+END_SRC  


#+BEGIN_SRC R :results raw output
  <<watchVars>>
  ## watchVars[ "precip"] <- "pr" 
  ascii( as.list( watchVars), list.type= "label")
#+END_SRC

#+RESULTS:
- precip :: pr_gpcc
- solar :: rsds
- tmax :: tasmax
- tmin :: tasmin


*** set mask and anchor points 

#+BEGIN_SRC R :results silent
  ## function getNcByVarYear( var, year)
  ## computes file name of input netCDF file by variable name and year
  ## and opens it
  
  ## getNcByVarYear <- function( var, year) {
  ##   ncFn <- sprintf( "data/nc/%1$s/%1$s_%2$d.nc", var, year)
  ##   list( nc_open( ncFn))
  ## }
  
  <<watchMask>>
    
  watchAnchorPoints <- {
    watchRes <- res( watchMask)[ 1]
    cbind(
      lon= seq(
        from= xmin( watchMask) + watchRes / 2,
        to= xmax( watchMask) - watchRes / 2,
        by= 3), 
      lat= ymax( watchMask))
  }
#+END_SRC

#+BEGIN_SRC R :tangle :results raw output
  ascii( head( watchAnchorPoints), digits=3, include.colnames= TRUE)
#+END_SRC

#+RESULTS:
|      lon |    lat |
| -179.750 | 67.000 |
| -176.750 | 67.000 |
| -173.750 | 67.000 |
| -170.750 | 67.000 |
| -167.750 | 67.000 |
| -164.750 | 67.000 |

#+BEGIN_SRC R :tangle :results raw output
  ascii( tail( watchAnchorPoints), digits=3, include.colnames= TRUE)
#+END_SRC

#+RESULTS:
|     lon |    lat |
| 162.250 | 67.000 |
| 165.250 | 67.000 |
| 168.250 | 67.000 |
| 171.250 | 67.000 |
| 174.250 | 67.000 |
| 177.250 | 67.000 |

#+BEGIN_SRC R :tangle :results value
  nrow( watchAnchorPoints)
#+END_SRC

#+RESULTS:
: 120

*** readWatchValues() reads in all data for a stripe

Given the stripe's corner in lon,lat and a width in cells.

#+BEGIN_SRC R :results silent
  readWatchValues <- function(  xy, var= "tmin", year= 1958, n= 6) {
    ncFn <- sprintf( "data/output/%s_watch_%s_30min.nc4", watchVars[ var], year)
    nc <- nc_open( ncFn)
    ## r <- raster( ncFn, band= 1)
    ## r <- raster( watchMask)
    column <-
      rowColFromCell(
        watchMask, cellFromXY(
          watchMask, xy= xy))[ 2]
    m <-
      ncvar_get(
        nc,
        varid= names( nc$var),
        start= c( column, 1, 1),
        count= c( n, -1, -1),             # collapse_degen seems to have
        collapse_degen= FALSE)            # no effect
    watchDays <-
      ncvar_get(
        nc,
        varid= "time",
        start= 1,
        count= -1)
    dn <- list(
      longitude= nc$dim$lon$vals[ column:(column +n -1)],
      latitude=  nc$dim$lat$vals[],
      time= watchDays)
    if( length( dim( m)) == 2)
      dim(m) <- c( 1, dim(m))             # to compensate for apparent
    dimnames( m) <- dn                    # collapse_degen bug
    m
  }
#+END_SRC  


*** Read in values for a single stripe

#+BEGIN_SRC R :tangle no :results silent
  stripe <- 1
  registerDoMC( 8)
  years <- 1958:2001
#+END_SRC

#+BEGIN_SRC R :results output
  
  ## cat( sprintf( "Time to load data for stripe %d:", stripe))
  
  ## system.time( {
  
  watchValues <-
    foreach(
      var= names( watchVars)) %:%
    ## var= "tmin",
    ## .inorder= TRUE) %:%
    foreach(
      year= years,
      .combine= abind,
      .multicombine= TRUE ) %dopar% {
        readWatchValues( watchAnchorPoints[ stripe,], var= var, year= year)
      }
  names( watchValues) <- names( watchVars)
  for( var in names( watchVars))
    names( dimnames( watchValues[[ var]])) <-
    c( "longitude", "latitude", "time")
  
  ## })
  
#+END_SRC

#+RESULTS:


*** these functions are used to set up the .psims.nc4 files 


**** ncDimsFunc() creates the dimensions

#+BEGIN_SRC R :results silent
    ncDimsFunc <- function(
      xy, ncDays,
      ncTimeName= "narr/time",
      ncTimeUnits= "days since 1978-12-31 00:00:00") {
      list(
        ncdim_def(
          name= "longitude",
          units= "degrees_east",
          vals= xy[[ "lon"]]),
        ncdim_def(
          name= "latitude",
          units= "degrees_north",
          vals= xy[[ "lat"]]),
        ncdim_def(
          name= ncTimeName,
          units= ncTimeUnits,
          vals= ncDays,
          unlim= TRUE))
    }

#+END_SRC    


**** ncVarsFunc() creates the variables using appropriate groups

#+BEGIN_SRC R :results silent
  ncVarsFunc <- function(
    xy, ncDays,
    ncGroupName= "narr",
    ncTimeUnits= "days since 1978-12-31 00:00:00",
    compression= 5) {
    list(
      ncvar_def(
        name= sprintf( "%s/tmin", ncGroupName),
        units= "C",
        longname= "daily minimum temperature",
        dim= ncDimsFunc( xy, ncDays,
          ncTimeUnits,
          ncTimeName= sprintf( "%s/time", ncGroupName)),
        compression= compression),
      ncvar_def(
        name= sprintf( "%s/tmax", ncGroupName),
        units= "C",
        longname= "daily maximum temperature",
        dim= ncDimsFunc( xy, ncDays,
          ncTimeUnits,
          ncTimeName= sprintf( "%s/time", ncGroupName)),
        compression= compression),
      ncvar_def(
        name= sprintf( "%s/precip", ncGroupName),
        units= "mm",
        longname= "daily total precipitation",
        dim= ncDimsFunc( xy, ncDays,
          ncTimeUnits,
          ncTimeName= sprintf( "%s/time", ncGroupName)),
        compression= compression),
      ncvar_def(
        name= sprintf( "%s/solar", ncGroupName),
        units= "MJ/m^2/day",
        longname= "daily average downward short-wave radiation flux",
        dim= ncDimsFunc( xy, ncDays,
          ncTimeUnits,
          ncTimeName= sprintf( "%s/time", ncGroupName)),            
        compression= compression))
  }
    
#+END_SRC    


**** psimsNcFromXY() creates the .psims.nc4 file and its directory

#+BEGIN_SRC R :results silent
  psimsNcFromXY <- function(
    xy, ncDays,
    resWorld= 0.5,
    ncTimeUnits= "days since 1860-01-01 00:00:00") {
    if( xy[[ "lon"]] > 180) {
      xy[[ "lon"]] <- xy[[ "lon"]] - 360
    }
    world <- raster()
    res( world) <- resWorld
    rowCol <- as.list( rowColFromCell( world, cellFromXY( world, xy))[1,])
    ncFile <- sprintf( "data/psims/%1$03d/%2$03d/%1$03d_%2$03d.psims.nc4", rowCol$row, rowCol$col)
    if( !file.exists( dirname( ncFile))) {
      dir.create( path= dirname( ncFile), recursive= TRUE)
    }
    if( file.exists( ncFile)) file.remove( ncFile)
    nc_create(
      filename= ncFile,
      vars= ncVarsFunc( xy, ncDays, 
        ncGroupName= "watch",
        ncTimeUnits= ncTimeUnits),
      force_v4= TRUE,
      verbose= FALSE)
  }
  
#+END_SRC


**** COMMENT inWatchMask() checks the mask 

to decide whether to write a file for a given cell

#+BEGIN_SRC R :results silent :tangle :eval no
  inWatchMask <- function( xy, file= "data/output/watchMask30min.tif") {
    watchMask <- raster( file)
    !is.na( extract( watchMask, rbind( xy)))
  }

#+END_SRC  


**** writePsimsNc() converts the units and writes out the time series

to the .psims.nc4 file

#+BEGIN_SRC R :results silent
  writePsimsNc <- function( watchValues, col, row) {
    xy <- c(
      lon= as.numeric( dimnames( watchValues[[ "tmin"]])$longitude[ col]),
      lat= as.numeric( dimnames( watchValues[[ "tmin"]])$latitude[  row]))
    if( is.na( extract( watchMask, rbind( xy)))) return( NA)
    psimsNc <- psimsNcFromXY(
      xy, ncDays= as.integer( dimnames( watchValues[[ "tmin"]])$time))
    for( var in names( watchValues)) {
      vals <- watchValues[[ var]][ col, row,]
      vals <- switch( var,
          solar= vals *86400 /1000000, # Change units to MJ /m^2 /day
          tmin= vals -273.15,          # change K to C
          tmax= vals -273.15,
          precip= vals *3600 *24)      # Change mm/s to mm/day
      ## browser()
      ncvar_put(
        nc= psimsNc,
        varid= sprintf( "watch/%s", var),
        vals= vals,
        count= c( 1, 1, -1))
    }
    nc_close( psimsNc)
    psimsNc$filename
  }
#+END_SRC  


**** loop over the stripe in parallel

Write a .psims.nc4 file for each grid cell in the mask.

#+BEGIN_SRC R
  
  ## time <-
  ##   system.time(
  
  psimsNcFile <-
    foreach( col= 1:6, .combine= c) %:%
    foreach( row= 1:254, .combine= c) %dopar% {
      writePsimsNc( watchValues, col, row)
    }
  
  ##   )
  
  cat(
    psimsNcFile,
    ## sprintf( "\n\nTime to write %d files:", length( psimsNcFile)),
    sep= "\n")
  
  ## print( time)
  
  
#+END_SRC


** cellNc.sbatch defines the jobs

#+BEGIN_SRC sh :shebang #!/bin/bash -l :tangle tangle/cellNc.sbatch

#SBATCH --account=pi-joshuaelliott
#SBATCH --qos=normal
# #SBATCH --partition=bigmem
#SBATCH --partition=westmere,sandyb
# #SBATCH --partition=sandyb
#SBATCH --time=60  # max minutes per run, will help the scheduler to get your job to run faster
#SBATCH --exclusive

START=$(date)
tangle/cellNc.r ${stripe}
END=$(date)
echo "started at $START"
echo "ended at $END"

#+END_SRC

** cellNc.sh submits a job for each stripe to the scheduler

#+BEGIN_SRC sh :session :results verbatim :shebang #!/bin/bash :tangle tangle/cellNc.sh

# based directly on an example provided by Dylan Hall (UofC RCC)

printf "| Submitting :: %10s | %+10s | %10s | %10s | %s |\n"\
  "job name" "output file" "error file" "sbatch file" "job id"
for stripe in {1..120};
# for stripe in {1..2};
do
    job_name="cellNc.r"  #name I came up with
    out_file=./logs/${job_name}.${stripe}.out  #puts the slurm output into this file
    err_file=./logs/${job_name}.${stripe}.err  #error output from slurm goes here
    sbatch_file=tangle/cellNc.sbatch  #The way this is written this file should be the same every time you run
    export stripe
    printf "| Submitting :: %10s | %10s | %10s | %10s |" \
	${job_name} ${out_file} ${err_file} ${sbatch_file}
    sbatch --job-name=${job_name} --output=${out_file} --error=${err_file} ${sbatch_file}
done


#+END_SRC

#+RESULTS:
#+begin_example
| Submitting ::   job name | output file | error file | sbatch file | job id |
| Submitting ::   cellNc.r | ./logs/cellNc.r.1.out | ./logs/cellNc.r.1.err | tangle/cellNc.sbatch |Submitted batch job 4229821
| Submitting ::   cellNc.r | ./logs/cellNc.r.2.out | ./logs/cellNc.r.2.err | tangle/cellNc.sbatch |Submitted batch job 4229822
| Submitting ::   cellNc.r | ./logs/cellNc.r.3.out | ./logs/cellNc.r.3.err | tangle/cellNc.sbatch |Submitted batch job 4229823
| Submitting ::   cellNc.r | ./logs/cellNc.r.4.out | ./logs/cellNc.r.4.err | tangle/cellNc.sbatch |Submitted batch job 4229824
| Submitting ::   cellNc.r | ./logs/cellNc.r.5.out | ./logs/cellNc.r.5.err | tangle/cellNc.sbatch |Submitted batch job 4229825
| Submitting ::   cellNc.r | ./logs/cellNc.r.6.out | ./logs/cellNc.r.6.err | tangle/cellNc.sbatch |Submitted batch job 4229826
| Submitting ::   cellNc.r | ./logs/cellNc.r.7.out | ./logs/cellNc.r.7.err | tangle/cellNc.sbatch |Submitted batch job 4229827
| Submitting ::   cellNc.r | ./logs/cellNc.r.8.out | ./logs/cellNc.r.8.err | tangle/cellNc.sbatch |Submitted batch job 4229828
| Submitting ::   cellNc.r | ./logs/cellNc.r.9.out | ./logs/cellNc.r.9.err | tangle/cellNc.sbatch |Submitted batch job 4229829
| Submitting ::   cellNc.r | ./logs/cellNc.r.10.out | ./logs/cellNc.r.10.err | tangle/cellNc.sbatch |Submitted batch job 4229830
| Submitting ::   cellNc.r | ./logs/cellNc.r.11.out | ./logs/cellNc.r.11.err | tangle/cellNc.sbatch |Submitted batch job 4229831
| Submitting ::   cellNc.r | ./logs/cellNc.r.12.out | ./logs/cellNc.r.12.err | tangle/cellNc.sbatch |Submitted batch job 4229832
| Submitting ::   cellNc.r | ./logs/cellNc.r.13.out | ./logs/cellNc.r.13.err | tangle/cellNc.sbatch |Submitted batch job 4229833
| Submitting ::   cellNc.r | ./logs/cellNc.r.14.out | ./logs/cellNc.r.14.err | tangle/cellNc.sbatch |Submitted batch job 4229834
| Submitting ::   cellNc.r | ./logs/cellNc.r.15.out | ./logs/cellNc.r.15.err | tangle/cellNc.sbatch |Submitted batch job 4229835
| Submitting ::   cellNc.r | ./logs/cellNc.r.16.out | ./logs/cellNc.r.16.err | tangle/cellNc.sbatch |Submitted batch job 4229836
| Submitting ::   cellNc.r | ./logs/cellNc.r.17.out | ./logs/cellNc.r.17.err | tangle/cellNc.sbatch |Submitted batch job 4229837
| Submitting ::   cellNc.r | ./logs/cellNc.r.18.out | ./logs/cellNc.r.18.err | tangle/cellNc.sbatch |Submitted batch job 4229838
| Submitting ::   cellNc.r | ./logs/cellNc.r.19.out | ./logs/cellNc.r.19.err | tangle/cellNc.sbatch |Submitted batch job 4229839
| Submitting ::   cellNc.r | ./logs/cellNc.r.20.out | ./logs/cellNc.r.20.err | tangle/cellNc.sbatch |Submitted batch job 4229840
| Submitting ::   cellNc.r | ./logs/cellNc.r.21.out | ./logs/cellNc.r.21.err | tangle/cellNc.sbatch |Submitted batch job 4229841
| Submitting ::   cellNc.r | ./logs/cellNc.r.22.out | ./logs/cellNc.r.22.err | tangle/cellNc.sbatch |Submitted batch job 4229842
| Submitting ::   cellNc.r | ./logs/cellNc.r.23.out | ./logs/cellNc.r.23.err | tangle/cellNc.sbatch |Submitted batch job 4229843
| Submitting ::   cellNc.r | ./logs/cellNc.r.24.out | ./logs/cellNc.r.24.err | tangle/cellNc.sbatch |Submitted batch job 4229844
| Submitting ::   cellNc.r | ./logs/cellNc.r.25.out | ./logs/cellNc.r.25.err | tangle/cellNc.sbatch |Submitted batch job 4229845
| Submitting ::   cellNc.r | ./logs/cellNc.r.26.out | ./logs/cellNc.r.26.err | tangle/cellNc.sbatch |Submitted batch job 4229846
| Submitting ::   cellNc.r | ./logs/cellNc.r.27.out | ./logs/cellNc.r.27.err | tangle/cellNc.sbatch |Submitted batch job 4229847
| Submitting ::   cellNc.r | ./logs/cellNc.r.28.out | ./logs/cellNc.r.28.err | tangle/cellNc.sbatch |Submitted batch job 4229848
| Submitting ::   cellNc.r | ./logs/cellNc.r.29.out | ./logs/cellNc.r.29.err | tangle/cellNc.sbatch |Submitted batch job 4229849
| Submitting ::   cellNc.r | ./logs/cellNc.r.30.out | ./logs/cellNc.r.30.err | tangle/cellNc.sbatch |Submitted batch job 4229850
| Submitting ::   cellNc.r | ./logs/cellNc.r.31.out | ./logs/cellNc.r.31.err | tangle/cellNc.sbatch |Submitted batch job 4229851
| Submitting ::   cellNc.r | ./logs/cellNc.r.32.out | ./logs/cellNc.r.32.err | tangle/cellNc.sbatch |Submitted batch job 4229852
| Submitting ::   cellNc.r | ./logs/cellNc.r.33.out | ./logs/cellNc.r.33.err | tangle/cellNc.sbatch |Submitted batch job 4229853
| Submitting ::   cellNc.r | ./logs/cellNc.r.34.out | ./logs/cellNc.r.34.err | tangle/cellNc.sbatch |Submitted batch job 4229854
| Submitting ::   cellNc.r | ./logs/cellNc.r.35.out | ./logs/cellNc.r.35.err | tangle/cellNc.sbatch |Submitted batch job 4229855
| Submitting ::   cellNc.r | ./logs/cellNc.r.36.out | ./logs/cellNc.r.36.err | tangle/cellNc.sbatch |Submitted batch job 4229856
| Submitting ::   cellNc.r | ./logs/cellNc.r.37.out | ./logs/cellNc.r.37.err | tangle/cellNc.sbatch |Submitted batch job 4229857
| Submitting ::   cellNc.r | ./logs/cellNc.r.38.out | ./logs/cellNc.r.38.err | tangle/cellNc.sbatch |Submitted batch job 4229858
| Submitting ::   cellNc.r | ./logs/cellNc.r.39.out | ./logs/cellNc.r.39.err | tangle/cellNc.sbatch |Submitted batch job 4229859
| Submitting ::   cellNc.r | ./logs/cellNc.r.40.out | ./logs/cellNc.r.40.err | tangle/cellNc.sbatch |Submitted batch job 4229860
| Submitting ::   cellNc.r | ./logs/cellNc.r.41.out | ./logs/cellNc.r.41.err | tangle/cellNc.sbatch |Submitted batch job 4229861
| Submitting ::   cellNc.r | ./logs/cellNc.r.42.out | ./logs/cellNc.r.42.err | tangle/cellNc.sbatch |Submitted batch job 4229862
| Submitting ::   cellNc.r | ./logs/cellNc.r.43.out | ./logs/cellNc.r.43.err | tangle/cellNc.sbatch |Submitted batch job 4229863
| Submitting ::   cellNc.r | ./logs/cellNc.r.44.out | ./logs/cellNc.r.44.err | tangle/cellNc.sbatch |Submitted batch job 4229864
| Submitting ::   cellNc.r | ./logs/cellNc.r.45.out | ./logs/cellNc.r.45.err | tangle/cellNc.sbatch |Submitted batch job 4229865
| Submitting ::   cellNc.r | ./logs/cellNc.r.46.out | ./logs/cellNc.r.46.err | tangle/cellNc.sbatch |Submitted batch job 4229866
| Submitting ::   cellNc.r | ./logs/cellNc.r.47.out | ./logs/cellNc.r.47.err | tangle/cellNc.sbatch |Submitted batch job 4229867
| Submitting ::   cellNc.r | ./logs/cellNc.r.48.out | ./logs/cellNc.r.48.err | tangle/cellNc.sbatch |Submitted batch job 4229868
| Submitting ::   cellNc.r | ./logs/cellNc.r.49.out | ./logs/cellNc.r.49.err | tangle/cellNc.sbatch |Submitted batch job 4229869
| Submitting ::   cellNc.r | ./logs/cellNc.r.50.out | ./logs/cellNc.r.50.err | tangle/cellNc.sbatch |Submitted batch job 4229870
| Submitting ::   cellNc.r | ./logs/cellNc.r.51.out | ./logs/cellNc.r.51.err | tangle/cellNc.sbatch |Submitted batch job 4229871
| Submitting ::   cellNc.r | ./logs/cellNc.r.52.out | ./logs/cellNc.r.52.err | tangle/cellNc.sbatch |Submitted batch job 4229872
| Submitting ::   cellNc.r | ./logs/cellNc.r.53.out | ./logs/cellNc.r.53.err | tangle/cellNc.sbatch |Submitted batch job 4229873
| Submitting ::   cellNc.r | ./logs/cellNc.r.54.out | ./logs/cellNc.r.54.err | tangle/cellNc.sbatch |Submitted batch job 4229874
| Submitting ::   cellNc.r | ./logs/cellNc.r.55.out | ./logs/cellNc.r.55.err | tangle/cellNc.sbatch |Submitted batch job 4229875
| Submitting ::   cellNc.r | ./logs/cellNc.r.56.out | ./logs/cellNc.r.56.err | tangle/cellNc.sbatch |Submitted batch job 4229876
| Submitting ::   cellNc.r | ./logs/cellNc.r.57.out | ./logs/cellNc.r.57.err | tangle/cellNc.sbatch |Submitted batch job 4229877
| Submitting ::   cellNc.r | ./logs/cellNc.r.58.out | ./logs/cellNc.r.58.err | tangle/cellNc.sbatch |Submitted batch job 4229878
| Submitting ::   cellNc.r | ./logs/cellNc.r.59.out | ./logs/cellNc.r.59.err | tangle/cellNc.sbatch |Submitted batch job 4229879
| Submitting ::   cellNc.r | ./logs/cellNc.r.60.out | ./logs/cellNc.r.60.err | tangle/cellNc.sbatch |Submitted batch job 4229880
| Submitting ::   cellNc.r | ./logs/cellNc.r.61.out | ./logs/cellNc.r.61.err | tangle/cellNc.sbatch |Submitted batch job 4229881
| Submitting ::   cellNc.r | ./logs/cellNc.r.62.out | ./logs/cellNc.r.62.err | tangle/cellNc.sbatch |Submitted batch job 4229882
| Submitting ::   cellNc.r | ./logs/cellNc.r.63.out | ./logs/cellNc.r.63.err | tangle/cellNc.sbatch |Submitted batch job 4229883
| Submitting ::   cellNc.r | ./logs/cellNc.r.64.out | ./logs/cellNc.r.64.err | tangle/cellNc.sbatch |Submitted batch job 4229884
| Submitting ::   cellNc.r | ./logs/cellNc.r.65.out | ./logs/cellNc.r.65.err | tangle/cellNc.sbatch |Submitted batch job 4229885
| Submitting ::   cellNc.r | ./logs/cellNc.r.66.out | ./logs/cellNc.r.66.err | tangle/cellNc.sbatch |Submitted batch job 4229886
| Submitting ::   cellNc.r | ./logs/cellNc.r.67.out | ./logs/cellNc.r.67.err | tangle/cellNc.sbatch |Submitted batch job 4229887
| Submitting ::   cellNc.r | ./logs/cellNc.r.68.out | ./logs/cellNc.r.68.err | tangle/cellNc.sbatch |Submitted batch job 4229888
| Submitting ::   cellNc.r | ./logs/cellNc.r.69.out | ./logs/cellNc.r.69.err | tangle/cellNc.sbatch |Submitted batch job 4229889
| Submitting ::   cellNc.r | ./logs/cellNc.r.70.out | ./logs/cellNc.r.70.err | tangle/cellNc.sbatch |Submitted batch job 4229890
| Submitting ::   cellNc.r | ./logs/cellNc.r.71.out | ./logs/cellNc.r.71.err | tangle/cellNc.sbatch |Submitted batch job 4229891
| Submitting ::   cellNc.r | ./logs/cellNc.r.72.out | ./logs/cellNc.r.72.err | tangle/cellNc.sbatch |Submitted batch job 4229892
| Submitting ::   cellNc.r | ./logs/cellNc.r.73.out | ./logs/cellNc.r.73.err | tangle/cellNc.sbatch |Submitted batch job 4229893
| Submitting ::   cellNc.r | ./logs/cellNc.r.74.out | ./logs/cellNc.r.74.err | tangle/cellNc.sbatch |Submitted batch job 4229894
| Submitting ::   cellNc.r | ./logs/cellNc.r.75.out | ./logs/cellNc.r.75.err | tangle/cellNc.sbatch |Submitted batch job 4229895
| Submitting ::   cellNc.r | ./logs/cellNc.r.76.out | ./logs/cellNc.r.76.err | tangle/cellNc.sbatch |Submitted batch job 4229896
| Submitting ::   cellNc.r | ./logs/cellNc.r.77.out | ./logs/cellNc.r.77.err | tangle/cellNc.sbatch |Submitted batch job 4229897
| Submitting ::   cellNc.r | ./logs/cellNc.r.78.out | ./logs/cellNc.r.78.err | tangle/cellNc.sbatch |Submitted batch job 4229898
| Submitting ::   cellNc.r | ./logs/cellNc.r.79.out | ./logs/cellNc.r.79.err | tangle/cellNc.sbatch |Submitted batch job 4229899
| Submitting ::   cellNc.r | ./logs/cellNc.r.80.out | ./logs/cellNc.r.80.err | tangle/cellNc.sbatch |Submitted batch job 4229900
| Submitting ::   cellNc.r | ./logs/cellNc.r.81.out | ./logs/cellNc.r.81.err | tangle/cellNc.sbatch |Submitted batch job 4229901
| Submitting ::   cellNc.r | ./logs/cellNc.r.82.out | ./logs/cellNc.r.82.err | tangle/cellNc.sbatch |Submitted batch job 4229902
| Submitting ::   cellNc.r | ./logs/cellNc.r.83.out | ./logs/cellNc.r.83.err | tangle/cellNc.sbatch |Submitted batch job 4229903
| Submitting ::   cellNc.r | ./logs/cellNc.r.84.out | ./logs/cellNc.r.84.err | tangle/cellNc.sbatch |Submitted batch job 4229904
| Submitting ::   cellNc.r | ./logs/cellNc.r.85.out | ./logs/cellNc.r.85.err | tangle/cellNc.sbatch |Submitted batch job 4229905
| Submitting ::   cellNc.r | ./logs/cellNc.r.86.out | ./logs/cellNc.r.86.err | tangle/cellNc.sbatch |Submitted batch job 4229906
| Submitting ::   cellNc.r | ./logs/cellNc.r.87.out | ./logs/cellNc.r.87.err | tangle/cellNc.sbatch |Submitted batch job 4229907
| Submitting ::   cellNc.r | ./logs/cellNc.r.88.out | ./logs/cellNc.r.88.err | tangle/cellNc.sbatch |Submitted batch job 4229908
| Submitting ::   cellNc.r | ./logs/cellNc.r.89.out | ./logs/cellNc.r.89.err | tangle/cellNc.sbatch |Submitted batch job 4229909
| Submitting ::   cellNc.r | ./logs/cellNc.r.90.out | ./logs/cellNc.r.90.err | tangle/cellNc.sbatch |Submitted batch job 4229910
| Submitting ::   cellNc.r | ./logs/cellNc.r.91.out | ./logs/cellNc.r.91.err | tangle/cellNc.sbatch |Submitted batch job 4229911
| Submitting ::   cellNc.r | ./logs/cellNc.r.92.out | ./logs/cellNc.r.92.err | tangle/cellNc.sbatch |Submitted batch job 4229912
| Submitting ::   cellNc.r | ./logs/cellNc.r.93.out | ./logs/cellNc.r.93.err | tangle/cellNc.sbatch |Submitted batch job 4229913
| Submitting ::   cellNc.r | ./logs/cellNc.r.94.out | ./logs/cellNc.r.94.err | tangle/cellNc.sbatch |Submitted batch job 4229914
| Submitting ::   cellNc.r | ./logs/cellNc.r.95.out | ./logs/cellNc.r.95.err | tangle/cellNc.sbatch |Submitted batch job 4229915
| Submitting ::   cellNc.r | ./logs/cellNc.r.96.out | ./logs/cellNc.r.96.err | tangle/cellNc.sbatch |Submitted batch job 4229916
| Submitting ::   cellNc.r | ./logs/cellNc.r.97.out | ./logs/cellNc.r.97.err | tangle/cellNc.sbatch |Submitted batch job 4229917
| Submitting ::   cellNc.r | ./logs/cellNc.r.98.out | ./logs/cellNc.r.98.err | tangle/cellNc.sbatch |Submitted batch job 4229918
| Submitting ::   cellNc.r | ./logs/cellNc.r.99.out | ./logs/cellNc.r.99.err | tangle/cellNc.sbatch |Submitted batch job 4229919
| Submitting ::   cellNc.r | ./logs/cellNc.r.100.out | ./logs/cellNc.r.100.err | tangle/cellNc.sbatch |Submitted batch job 4229920
| Submitting ::   cellNc.r | ./logs/cellNc.r.101.out | ./logs/cellNc.r.101.err | tangle/cellNc.sbatch |Submitted batch job 4229921
| Submitting ::   cellNc.r | ./logs/cellNc.r.102.out | ./logs/cellNc.r.102.err | tangle/cellNc.sbatch |Submitted batch job 4229922
| Submitting ::   cellNc.r | ./logs/cellNc.r.103.out | ./logs/cellNc.r.103.err | tangle/cellNc.sbatch |Submitted batch job 4229923
| Submitting ::   cellNc.r | ./logs/cellNc.r.104.out | ./logs/cellNc.r.104.err | tangle/cellNc.sbatch |Submitted batch job 4229924
| Submitting ::   cellNc.r | ./logs/cellNc.r.105.out | ./logs/cellNc.r.105.err | tangle/cellNc.sbatch |Submitted batch job 4229925
| Submitting ::   cellNc.r | ./logs/cellNc.r.106.out | ./logs/cellNc.r.106.err | tangle/cellNc.sbatch |Submitted batch job 4229926
| Submitting ::   cellNc.r | ./logs/cellNc.r.107.out | ./logs/cellNc.r.107.err | tangle/cellNc.sbatch |Submitted batch job 4229927
| Submitting ::   cellNc.r | ./logs/cellNc.r.108.out | ./logs/cellNc.r.108.err | tangle/cellNc.sbatch |Submitted batch job 4229928
| Submitting ::   cellNc.r | ./logs/cellNc.r.109.out | ./logs/cellNc.r.109.err | tangle/cellNc.sbatch |Submitted batch job 4229929
| Submitting ::   cellNc.r | ./logs/cellNc.r.110.out | ./logs/cellNc.r.110.err | tangle/cellNc.sbatch |Submitted batch job 4229930
| Submitting ::   cellNc.r | ./logs/cellNc.r.111.out | ./logs/cellNc.r.111.err | tangle/cellNc.sbatch |Submitted batch job 4229931
| Submitting ::   cellNc.r | ./logs/cellNc.r.112.out | ./logs/cellNc.r.112.err | tangle/cellNc.sbatch |Submitted batch job 4229932
| Submitting ::   cellNc.r | ./logs/cellNc.r.113.out | ./logs/cellNc.r.113.err | tangle/cellNc.sbatch |Submitted batch job 4229933
| Submitting ::   cellNc.r | ./logs/cellNc.r.114.out | ./logs/cellNc.r.114.err | tangle/cellNc.sbatch |Submitted batch job 4229934
| Submitting ::   cellNc.r | ./logs/cellNc.r.115.out | ./logs/cellNc.r.115.err | tangle/cellNc.sbatch |Submitted batch job 4229935
| Submitting ::   cellNc.r | ./logs/cellNc.r.116.out | ./logs/cellNc.r.116.err | tangle/cellNc.sbatch |Submitted batch job 4229936
| Submitting ::   cellNc.r | ./logs/cellNc.r.117.out | ./logs/cellNc.r.117.err | tangle/cellNc.sbatch |Submitted batch job 4229937
| Submitting ::   cellNc.r | ./logs/cellNc.r.118.out | ./logs/cellNc.r.118.err | tangle/cellNc.sbatch |Submitted batch job 4229938
| Submitting ::   cellNc.r | ./logs/cellNc.r.119.out | ./logs/cellNc.r.119.err | tangle/cellNc.sbatch |Submitted batch job 4229939
| Submitting ::   cellNc.r | ./logs/cellNc.r.120.out | ./logs/cellNc.r.120.err | tangle/cellNc.sbatch |Submitted batch job 4229940
#+end_example


#+BEGIN_SRC sh :session :results silent
  scancel -u nbest -p 
#+END_SRC

#+BEGIN_SRC sh :session :results raw
  grep -l Error logs/*.out
#+END_SRC

#+BEGIN_SRC sh :session
  find data/psims/ -type f | wc -l
#+END_SRC

#+RESULTS:
: 33284



** Demonstrate ncdf4 time metadata

#+BEGIN_SRC R :results value
  nc <- nc_open( "data/psims/047/001/047_001.psims.nc4")
  nc$dim$`watch/time`$units
#+END_SRC

#+RESULTS:
: days since 1860-01-01 00:00:00

